### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.aws_route53_record.design_vy_no will be created
  + resource "aws_route53_record" "design_vy_no" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.design.vy.no"
      + records         = [
          + "designmanual.stage.vylabs.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.app.aws_route53_zone.design_vy_no will be created
  + resource "aws_route53_zone" "design_vy_no" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "stage.design.vy.no"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 35c720cb590870fa8e4301c1c01eb611bca94645*
*Plan generated at: 2025-10-16 11:35:46 UTC*
